app/controllers/articles_controller.rb

  def index
    @articles = Article.order("#{sort_column} #{sort_direction}")
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "あああ"], ["content", "あああ"], ["created_at", "2022-06-16 02:44:37.704848"], ["updated_at", "2022-06-16 02:44:37.704848"]]

  def update
    @article = Article.find(params[:id])
    if @article.update(article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "content" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["content", "マニマニ2"], ["updated_at", "2022-06-16 02:46:38.586904"], ["id", 10]]