app/controllers/employees_controller.rb

SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL ORDER BY department_id desc
---
  def index
    @employees = Employee.active.order("#{sort_column} #{sort_direction}")

INSERT INTO "employees" ("department_id", "office_id", "number", "last_name", "first_name", "account", "password", "email", "date_of_joining", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)

    add_params

    if @employee.save

UPDATE "employees" SET "employee_info_manage_auth" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["employee_info_manage_auth", 1], ["updated_at", "2022-06-16 01:49:17.359595"], ["id", 4]]
---
  def update
    add_params

    if @employee.update(employee_params)

SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def set_employee
    @employee = Employee.find(params["id"])

SELECT "departments".* FROM "departments"
SELECT "offices".* FROM "offices"
---
  def set_form_option
    @departments = Department.all
    @offices = Office.all